/*    
      ____                      _____                  +---+
     / ___\                     / __ \                 | R |
    / /                        / /_/ /                 +---+
   / /   ________  ____  ___  / ____/___  ____  __   __
  / /  / ___/ __ `/_  / / _ \/ /   / __ \/ _  \/ /  / /
 / /__/ /  / /_/ / / /_/  __/ /   / /_/ / / / / /__/ /
 \___/_/   \__,_/ /___/\___/_/    \___ /_/ /_/____  /
                                                 / /
                                            ____/ /
                                           /_____/
BT.c file
编写者：小马  (Camel)
作者E-mail：375836945@qq.com
编译环境：MDK-Lite  Version: 4.23
初版时间: 2014-01-28
功能：
1.蓝牙透传模块的电源使能端BT_EN--->PB2
2.打开蓝牙电源-->BT_EN=1;
------------------------------------
*/


#include "BT.h"
#include "UART1.h"
#include "stdio.h"
/********************************************
              Led初始化函数
********************************************/
void BT_PowerInit(void)
{
    RCC->APB2ENR|=1<<3;    //使能PORTB时钟	

    GPIOB->CRL&=0XFFFFF0FF;  //PB2推挽输出
    GPIOB->CRL|=0X00000300;
    GPIOB->ODR|=1<<2;        //PB2上拉
    BT_off();                //默认关闭

}



